wms_mobile/src/DataProcessors/ДиспетчерЗадач/ДиспетчерЗадач.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ДиспетчерЗадач</name>
</mdclass:DataProcessor>

wms_mobile/src/InformationRegisters/итЗадачиКРаспределению/итЗадачиКРаспределению.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>итЗадачиКРаспределению</name>
  <resources>
    <name>ИдентификаторУпаковки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>172</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПредставлениеЗадачи</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДополнительныеДанные</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>ДокументОснованиеПредставление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Состояние</name>
    <type>
      <types>EnumRef.итWMSСостоянияЗадачТСД</types>
    </type>
  </attributes>
  <dimensions>
    <name>ДокументОснование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипЗадачи</name>
    <type>
      <types>EnumRef.итWMSТипыЗадачТСД</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдЗадачи</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

wms_mobile/src/InformationRegisters/ИтЗадачиНаТСД/ИтЗадачиНаТСД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИтЗадачиНаТСД</name>
  <resources>
    <name>ИдентификаторУпаковки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>172</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЯчейкаОтправитель</name>
    <type>
      <types>UUID</types>
    </type>
  </resources>
  <resources>
    <name>ЯчейкаОтправительПредставление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЯчейкаПолучатель</name>
    <type>
      <types>UUID</types>
    </type>
  </resources>
  <resources>
    <name>ЯчейкаПолучательПредставление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДополнительныеДанные</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <attributes>
    <name>Состояние</name>
    <type>
      <types>EnumRef.итWMSСостоянияЗадачТСД</types>
    </type>
  </attributes>
  <attributes>
    <name>ДанныеДокументаТСД</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <dimensions>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.итНаборка</types>
      <types>DocumentRef.итОтгрузка</types>
      <types>DocumentRef.итПриемка</types>
      <types>DocumentRef.итЗадачиИнвентаризации</types>
      <types>DocumentRef.итПеремещение</types>
      <types>DocumentRef.итКонтрольнаяАгрегация</types>
      <types>DocumentRef.итРазмещение</types>
      <types>DocumentRef.итПроверка</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипЗадачи</name>
    <type>
      <types>EnumRef.итWMSТипыЗадачТСД</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдЗадачи</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

wms_mobile/src/Enums/итWMSТипыЗадачТСД/итWMSТипыЗадачТСД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>итWMSТипыЗадачТСД</name>
  <enumValues>
    <name>Приемка</name>
  </enumValues>
  <enumValues>
    <name>Размещение</name>
  </enumValues>
  <enumValues>
    <name>Перемещение</name>
  </enumValues>
  <enumValues>
    <name>Инвентаризация</name>
  </enumValues>
  <enumValues>
    <name>Наборка</name>
  </enumValues>
  <enumValues>
    <name>ПриемкаКакЕсть</name>
  </enumValues>
  <enumValues>
    <name>Отгрузка</name>
  </enumValues>
  <enumValues>
    <name>КонтрольнаяАгрегация</name>
  </enumValues>
  <enumValues>
    <name>Проверка</name>
  </enumValues>
  <enumValues>
    <name>Переупаковка</name>
  </enumValues>
</mdclass:Enum>

wms_mobile/src/Enums/итWMSСостоянияЗадачТСД/итWMSСостоянияЗадачТСД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>итWMSСостоянияЗадачТСД</name>
  <enumValues>
    <name>КВыполнению</name>
  </enumValues>
  <enumValues>
    <name>ОжидаетРазрешения</name>
  </enumValues>
  <enumValues>
    <name>Отменена</name>
  </enumValues>
  <enumValues>
    <name>Выполнена</name>
  </enumValues>
  <enumValues>
    <name>Выполняется</name>
  </enumValues>
</mdclass:Enum>

wms_mobile/src/DataProcessors/ДиспетчерЗадач/Forms/ЗадачиКРаспределению/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
ОбработчикиЗапросаСервера.ОбновитьСписокЗадачКРаспределению();
СтруктураДанныхДляКлиента = новый Структура;
для Каждого Перечисления_ из Перечисления.итWMSТипыЗадачТСД цикл
	СтруктураДанныхДляКлиента.Вставить(СтрЗаменить(ТРег(Строка(Перечисления_))," ",""),Перечисления_);
КонецЦикла;
ПолеПречисленияДляКлиента=СтруктураДанныхДляКлиента;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
ОбщийМодульКлиентскойЧасти.ПереопределенияТригераПолучениеШтрихКодаПриОткрытии(ЭтаФорма);	
ПодключитьОбработчикОжидания("ОпросСервераБазыДанных",35,Ложь);
КонецПроцедуры

#Область ПолучениеДанныхССервера
&НаКлиенте
Процедура ОпросСервераБазыДанных() Экспорт 
//ОпросСервераБазыДанныхНаСервере()
Если ВводДоступен() Тогда 
ОпросСервераБазыДанныхНаСервереАссинхронно();
КонецЕсли;
КонецПроцедуры

&НаСервере
процедура ОпросСервераБазыДанныхНаСервереАссинхронно()
	ПараметрыМетода = новый Массив;
	СтруктураДанных=новый Структура;
	СлужебныеФункцииИПроцедурыКлиентСервер.СформироватьСтруктуруДанныхОПользователе(СтруктураДанных);
	ПараметрыМетода.Добавить(СтруктураДанных);
	ФоновыеЗадания.Выполнить("ОбработчикиЗапросаСервера.ОбновитьСписокЗадачКРаспределению",ПараметрыМетода,новый УникальныйИдентификатор,"Обновить список задач к распределению");
КонецПроцедуры


#КонецОбласти


&НаКлиенте
Процедура ЗадачиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если  ТипЗнч(Элемент.ТекущаяСтрока) = тип("РегистрСведенийКлючЗаписи.итЗадачиКРаспределению") тогда
		СтандартнаяОбработка=Ложь;
		ОткрытьФорму("Обработка.ДиспетчерЗадач.Форма.ФормаВыбораДействий",новый Структура("КлючЗаписи",Текущийэлемент.ТекущаяСтрока),ЭтаФорма);
		ТригерПриемаСканераШтрихКода=Ложь;
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура Отмена(Команда)
	ТекущийЭлемент=Элементы.Задачи.КоманднаяПанель;
КонецПроцедуры



&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
ОбщийМодульКлиентскойЧасти.ПереопределенияТригераПолучениеШтрихКодаПриЗакрытии(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	 Если ИмяСобытия="ОбновлениеДанныхДинамическихСписков" и Источник=ОбщийМодульКлиентскойЧасти тогда
		Элементы.Задачи.Обновить();
	 КонецЕсли;
     Если ИмяСобытия="ОбработчикШтрихКода"  и ТригерПриемаСканераШтрихКода тогда
		Если Параметр=404 и Источник="ОшибкаЧтения" тогда
			ОбщийМодульКлиентскойЧасти.СообщитьЧерезФорму("Штрих код некорректен");
			Возврат
		КонецЕсли;	
		ПолучитьИнформациюОЗадачахПоШтрихКоду(Параметр)
	КонецЕсли;

КонецПроцедуры
&НаКлиенте
Процедура  ПолучитьИнформациюОЗадачахПоШтрихКоду(ШтрихКод)
КлючЗаписи=ПоискИСозданиеКлючаЗаписиПоШтрихКоду(ШтрихКод);
Если КлючЗаписи=Неопределено Тогда 
	Сообщить("Задач со штрих кодом "+ШтрихКод+" не найдено");
Возврат
КонецЕсли;
//Если Найти(НРег(Строка(ВренутьЗначениеПоля(КлючЗаписи,"ТипЗадачи"))),НРег("Размещение")) тогда
Если СверитьДанныеОткрытияШтрихКодом(КлючЗаписи) тогда
 ИдЗадачиКлюча=ВренутьЗначениеПоля(КлючЗаписи,"ИдЗадачи");
 АдресДанныхОповещения=ПринятьКИсполнениюЗадачуНаСервере(КлючЗаписи);
 ОбработкаПолученныхДанныхКлиент(АдресДанныхОповещения,ИдЗадачиКлюча);
иначе
	ОткрытьФорму("Обработка.ДиспетчерЗадач.Форма.ФормаВыбораДействий",новый Структура("КлючЗаписи",КлючЗаписи),ЭтаФорма);
КонецЕсли;
ТригерПриемаСканераШтрихКода=Ложь;
КонецПроцедуры

&НаСервереБезКонтекста	
Функция ПоискИСозданиеКлючаЗаписиПоШтрихКоду(ШтрихКод)
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	итЗадачиКРаспределению.ДокументОснование КАК ДокументОснование,
		|	итЗадачиКРаспределению.ТипЗадачи КАК ТипЗадачи,
		|	итЗадачиКРаспределению.ИдЗадачи КАК ИдЗадачи,
		|	итЗадачиКРаспределению.ИдентификаторУпаковки КАК ИдентификаторУпаковки,
		|	итЗадачиКРаспределению.Состояние КАК Состояние
		|ИЗ
		|	РегистрСведений.итЗадачиКРаспределению КАК итЗадачиКРаспределению
		|ГДЕ
		|	итЗадачиКРаспределению.ИдентификаторУпаковки = &ИдентификаторУпаковки
		|	И итЗадачиКРаспределению.Состояние = ЗНАЧЕНИЕ(Перечисление.итWMSСостоянияЗадачТСД.КВыполнению)";
	
	Запрос.УстановитьПараметр("ИдентификаторУпаковки", ШтрихКод);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если  ВыборкаДетальныеЗаписи.Следующий() Тогда 
		КлючЗаписи=РегистрыСведений.итЗадачиКРаспределению.СоздатьКлючЗаписи(новый Структура("ДокументОснование,ТипЗадачи,ИдЗадачи",ВыборкаДетальныеЗаписи.ДокументОснование,ВыборкаДетальныеЗаписи.ТипЗадачи,ВыборкаДетальныеЗаписи.ИдЗадачи));
		Возврат КлючЗаписи;
	КонецЕсли;
	Возврат Неопределено;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	
		КонецФункции
		
#Область ПринятьЗадачуНаСервереПринудительно
&НаКлиенте
Процедура ОбработкаПолученныхДанныхКлиент(ВыбранноеЗначение,ИдЗадачиКлюча)
	МассивСозданныхОбъектовДанных=Неопределено;
	ОбработкаПолученныхДанныхСервер(ВыбранноеЗначение,МассивСозданныхОбъектовДанных);
	Если  ТипЗнч(МассивСозданныхОбъектовДанных)=тип("Массив") тогда
		Если МассивСозданныхОбъектовДанных.Количество()>0 тогда
			ДанныеСканированнойЗадачи= ПолучитьКлючиДляРаботыСДанными(ИдЗадачиКлюча);
			ОткрытьФорму("Обработка.ДиспетчерЗадач.Форма.МоиЗадачиОбщийСписок",новый Структура("ДанныеСканированнойЗадачи",ДанныеСканированнойЗадачи),ЭтаФорма);
			ТригерПриемаСканераШтрихКода=Ложь;
		иначе
			Сообщить("Не каких новых данных загруженно не было");
			ЭтаФорма.Закрыть();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
&НаСервере
Процедура ОбработкаПолученныхДанныхСервер(ВыбранноеЗначение,МассивСозданныхОбъектовДанных)
СтруктураДанных=ПолучитьИзВременногоХранилища(ВыбранноеЗначение);
Если СлужебныеФункцииИПроцедурыКлиентСервер.ТиповойОбработчикОшибок(СтруктураДанных)тогда
	Возврат
КонецЕсли;
МодульРаспределенияДанных.ОбработчикВходящихДанных(СтруктураДанных,ВыбранноеЗначение);
ОбработчикиЗапросаСервера.ОбновитьСписокЗадачКРаспределению();
ОбработанныеДанные=ПолучитьИзВременногоХранилища(ВыбранноеЗначение);
Если ТипЗнч(ОбработанныеДанные)=тип("Структура") тогда
	Если ОбработанныеДанные.Свойство("МассивСозданныхОбъектовДанных") тогда
	МассивСозданныхОбъектовДанных=ОбработанныеДанные.МассивСозданныхОбъектовДанных;
КонецЕсли;
КонецЕсли;
	КонецПроцедуры
&НаСервере
Функция ПолучитьКлючиДляРаботыСДанными(ИдЗадачиКлюча)
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИтЗадачиНаТСД.ДокументОснование КАК ДокументОснование,
		|	ИтЗадачиНаТСД.ТипЗадачи КАК ТипЗадачи,
		|	ИтЗадачиНаТСД.ИдЗадачи КАК ИдЗадачи,
		|	ИтЗадачиНаТСД.ИдентификаторУпаковки КАК ИдентификаторУпаковки
		|ИЗ
		|	РегистрСведений.ИтЗадачиНаТСД КАК ИтЗадачиНаТСД
		|ГДЕ
		|	ИтЗадачиНаТСД.ИдЗадачи = &ИдЗадачи";
	
	Запрос.УстановитьПараметр("ИдЗадачи", ИдЗадачиКлюча);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если  ВыборкаДетальныеЗаписи.Следующий() тогда
	СтруктураДанных=новый Структура;
	для Каждого  Колонка из РезультатЗапроса.Колонки цикл
		СтруктураДанных.Вставить(Колонка.Имя,ВыборкаДетальныеЗаписи[Колонка.Имя]);
	КонецЦикла;
	Возврат СтруктураДанных;
	КонецЕсли;
	Возврат Неопределено;
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	
КонецФункции

&НаСервере
Функция  ПринятьКИсполнениюЗадачуНаСервере(КлючЗаписи)
УникальныйИдентификаторФормы=ЭтаФорма.УникальныйИдентификатор;
СтруктураДанных=новый Структура;
СлужебныеФункцииИПроцедурыКлиентСервер.СформироватьСтруктуруДанныхОПользователе(СтруктураДанных);
СтруктураДанных.Вставить("ТипПолученияДанных","Задача");
СтруктураДанных.Вставить("КлючПолученияДанных",КлючЗаписи.ИдЗадачи);
СтруктураДанных.Вставить("ТипЗадачи",КлючЗаписи.ТипЗадачи);
Ответ=ОбработчикиЗапросаСервера.ЗапроситьДанные(СтруктураДанных,"DataRegistrationAndDonload");
АдресДанныхОповещения=ПоместитьВоВременноеХранилище(Ответ,УникальныйИдентификаторФормы);
Возврат АдресДанныхОповещения;   	
КонецФункции
&НаСервереБезКонтекста
Функция ВренутьЗначениеПоля(Переменная,Поле)
	Возврат Переменная[Поле];
КонецФункции

&НаСервереБезКонтекста
Функция СверитьДанныеОткрытияШтрихКодом(КлючЗаписи)
	Если КлючЗаписи.ТипЗадачи=Перечисления.итWMSТипыЗадачТСД.Размещение или
		 КлючЗаписи.ТипЗадачи=Перечисления.итWMSТипыЗадачТСД.Отгрузка Тогда 
		 Возврат Истина ;
	 иначе
		 Возврат Ложь ;
	КонецЕсли;	 
	КонецФункции
#КонецОбласти
#Область ЗаконсервированныйКод
//&НаКлиенте
//Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
//	МассивСозданныхОбъектовДанных=Неопределено;
//	ОбработкаВыбораСервер(ВыбранноеЗначение,МассивСозданныхОбъектовДанных);
//	Если  ТипЗнч(МассивСозданныхОбъектовДанных)=тип("Массив") тогда
//		Если МассивСозданныхОбъектовДанных.Количество()>0 тогда
//			ОткрытьФорму("Обработка.ДиспетчерЗадач.Форма.ПолученныеЗадачи",новый Структура("МассивСозданныхОбъектовДанных",МассивСозданныхОбъектовДанных),ЭтаФорма);
//			ТригерПриемаСканераШтрихКода=Ложь;
//		иначе
//			Сообщить("Не каких новых данных загруженно не было");
//		КонецЕсли;
//	КонецЕсли;
//КонецПроцедуры
//&НаСервере
//Процедура ОбработкаВыбораСервер(ВыбранноеЗначение,МассивСозданныхОбъектовДанных)
//СтруктураДанных=ПолучитьИзВременногоХранилища(ВыбранноеЗначение);
//Если СлужебныеФункцииИПроцедурыКлиентСервер.ТиповойОбработчикОшибок(СтруктураДанных)тогда
//	Возврат
//КонецЕсли;
//МодульРаспределенияДанных.ОбработчикВходящихДанных(СтруктураДанных,ВыбранноеЗначение);
//ОбработчикиЗапросаСервера.ОбновитьСписокЗадачКРаспределению();
//ОбработанныеДанные=ПолучитьИзВременногоХранилища(ВыбранноеЗначение);
//Если ТипЗнч(ОбработанныеДанные)=тип("Структура") тогда
//	Если ОбработанныеДанные.Свойство("МассивСозданныхОбъектовДанных") тогда
//	МассивСозданныхОбъектовДанных=ОбработанныеДанные.МассивСозданныхОбъектовДанных;
//КонецЕсли;
//КонецЕсли;
//	КонецПроцедуры

#КонецОбласти
